Билет11/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНакладных</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет11/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет11/src/Documents/ПриходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать();
	Движения.Взаиморасчеты.Записывать = Истина;
	//блокирвока
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходДенегСписокНакладных.Накладная КАК Накладная
		|ПОМЕСТИТЬ втТЧНакладные
		|ИЗ
		|	Документ.ПриходДенег.СписокНакладных КАК ПриходДенегСписокНакладных
		|ГДЕ
		|	ПриходДенегСписокНакладных.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Накладная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Накладная КАК Накладная,
		|	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаКОплатеОстаток, 0) КАК СуммаКОплате
		|ИЗ
		|	втТЧНакладные КАК втТЧНакладные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Взаиморасчеты.Остатки(
		|				&МоментВремени,
		|				Накладная В
		|					(ВЫБРАТЬ
		|						втТЧНакладные.Накладная КАК Накладная
		|					ИЗ
		|						втТЧНакладные КАК втТЧНакладные)) КАК ВзаиморасчетыОстатки
		|		ПО втТЧНакладные.Накладная = ВзаиморасчетыОстатки.Накладная
		|
		|УПОРЯДОЧИТЬ ПО
		|	втТЧНакладные.Накладная.МоментВремени
		|ИТОГИ
		|	СУММА(СуммаКОплате)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	Если СуммаОплаты > ВыборкаОбщийИтог.СуммаКОплате Тогда
	     Отказ = Истина;
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = СтрШаблон("Вы пытаетесь оплатить больше чем тек долг - %1.",
		 								ВыборкаОбщийИтог.СуммаКОплате);
		 Сообщение.Сообщить();
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Выборка = ВыборкаОбщийИтог.Выбрать();
	СуммаСписать = СуммаОплаты;
	Пока Выборка.Следующий() И СуммаСписать > 0 Цикл
		//списание по накладным с самой ренней
		Движение = Движения.Взаиморасчеты.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Накладная = Выборка.Накладная;
		Движение.СуммаКОплате = Мин(СуммаСписать, Выборка.СуммаКОплате);
        СуммаСписать = СуммаСписать - Выборка.СуммаКОплате;
	КонецЦикла;
	
КонецПроцедуры
